In [1]:
import numpy as np
import pandas as pd

In [2]:
data = pd.read_csv('titanic_train.csv')
data.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [3]:
data.isnull().sum()

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age            177
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         2
dtype: int64

In [4]:
data['Age'] = data['Age'].fillna(data['Age'].median())

In [5]:
data.isnull().sum()

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age              0
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         2
dtype: int64

In [6]:
data.Cabin.value_counts()

C23 C25 C27    4
B96 B98        4
G6             4
C22 C26        3
F33            3
              ..
C90            1
D21            1
E58            1
B102           1
A23            1
Name: Cabin, Length: 147, dtype: int64

In [7]:
data['Sex'] = data['Sex'].apply(lambda x: 1 if x == 'male' else 0)

In [8]:
data.Embarked.value_counts()

S    644
C    168
Q     77
Name: Embarked, dtype: int64

In [9]:
data.isnull().sum()

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age              0
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         2
dtype: int64

In [10]:
embark = pd.get_dummies(data['Embarked'], drop_first=True)

In [11]:
embark

     Q  S
0    0  1
1    0  0
2    0  1
3    0  1
4    0  1
..  .. ..
886  0  1
887  0  1
888  0  1
889  0  0
890  1  0

[891 rows x 2 columns]

In [12]:
final_data = pd.concat([data, embark], axis=1)

In [13]:
final_data.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Q,S
0,1,0,3,"Braund, Mr. Owen Harris",1,22.0,1,0,A/5 21171,7.2500,NaN,S,0,1
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",0,38.0,1,0,PC 17599,71.2833,C85,C,0,0
2,3,1,3,"Heikkinen, Miss. Laina",0,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,0,1
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",0,35.0,1,0,113803,53.1000,C123,S,0,1
4,5,0,3,"Allen, Mr. William Henry",1,35.0,0,0,373450,8.0500,NaN,S,0,1

In [14]:
final_data.drop(['PassengerId', 'Name', 'Ticket', 'Cabin', 'Embarked'], axis=1, inplace=True)

In [15]:
final_data.dropna(inplace=True)

In [16]:
final_data.head()

   Survived  Pclass  Sex   Age  SibSp  Parch     Fare  Q  S
0         0       3    1  22.0      1      0   7.2500  0  1
1         1       1    0  38.0      1      0  71.2833  0  0
2         1       3    0  26.0      0      0   7.9250  0  1
3         1       1    0  35.0      1      0  53.1000  0  1
4         0       3    1  35.0      0      0   8.0500  0  1

In [17]:
final_data.isnull().sum()

Survived    0
Pclass      0
Sex         0
Age         0
SibSp       0
Parch       0
Fare        0
Q           0
S           0
dtype: int64

In [18]:
X = final_data.drop('Survived', axis=1)
X.head()

   Pclass  Sex   Age  SibSp  Parch     Fare  Q  S
0       3    1  22.0      1      0   7.2500  0  1
1       1    0  38.0      1      0  71.2833  0  0
2       3    0  26.0      0      0   7.9250  0  1
3       1    0  35.0      1      0  53.1000  0  1
4       3    1  35.0      0      0   8.0500  0  1

In [19]:
Y = final_data.Survived
Y

0      0
1      1
2      1
3      1
4      0
      ..
886    0
887    1
888    0
889    1
890    0
Name: Survived, Length: 891, dtype: int64

In [20]:
from sklearn.model_selection import train_test_split

In [21]:
X_train, X_test, Y_train, Y_test = train_test_split(X, Y, test_size=0.2, random_state=42)

### Train and build Classifier using LogisticRegression

In [22]:
from sklearn.linear_model import LogisticRegression

In [23]:
model1 = LogisticRegression().fit(X_train, Y_train)

c:\program files\python37\lib\site-packages\sklearn\linear_model\_logistic.py:764: ConvergenceWarning: lbfgs failed to converge (status=1):
STOP: TOTAL NO. of ITERATIONS REACHED LIMIT.

Increase the number of iterations (max_iter) or scale the data as shown in:
    https://scikit-learn.org/stable/modules/preprocessing.html
Please also refer to the documentation for alternative solver options:
    https://scikit-learn.org/stable/modules/linear_model.html#logistic-regression
  extra_warning_msg=_LOGISTIC_SOLVER_CONVERGENCE_MSG)

In [24]:
model1.score(X_test, Y_test)

0.7988826815642458

### Now train and build the classifier by using ensemble technique to get the best score

In [25]:
from sklearn.tree import DecisionTreeClassifier
from sklearn.ensemble import AdaBoostClassifier

In [37]:
model2 = AdaBoostClassifier(base_estimator=DecisionTreeClassifier(random_state=42), n_estimators=800)

In [38]:
model2.fit(X_train, Y_train)

AdaBoostClassifier(base_estimator=DecisionTreeClassifier(random_state=42),
                   n_estimators=800)

In [39]:
prediction = model2.predict(X_test)

In [40]:
from sklearn.metrics import confusion_matrix, accuracy_score

In [41]:
cm = confusion_matrix(Y_test, prediction)
cm

array([[85, 20],
       [13, 61]], dtype=int64)

In [42]:
acc = accuracy_score(Y_test, prediction)
acc

0.8156424581005587